slotburner-fpv-halfmillioncell/0/PV.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      PV;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(outlet|entrainmentBottom|entrainmentWestSide|entrainmentNorthSide|entrainmentEastSide|entrainmentSouthSide)"
    {
        type            zeroGradient;
    }
    
    fixedWalls
    {
        type            zeroGradient;
    }
    inletFuel
    {
        type            fixedValue;
        value           uniform 0;
    }
    inletCoflow
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
