slotburner-fpv-halfmillioncell/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue 	uniform (0 0 0);
        value           uniform (0 0 0);
    }

    entrainmentBottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    entrainmentWestSide
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    entrainmentNorthSide
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    entrainmentEastSide
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }   

    entrainmentSouthSide
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    fixedWalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    inletFuel
    {
        type            fixedValue;
        value           uniform (0 0 0.06);
    }
    
    inletCoflow
    {
        type            fixedValue;
        value           uniform (0 0 0.25);
    }
 
}


// ************************************************************************* //
