slotburner-fpv-halfmillioncell/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    outlet
    {
        type            calculated;
 	value		uniform 0;
    }

    inletFuel
    {
        type            calculated;
 	value		uniform 0;
    }

    inletCoflow
    {
        type            calculated;
 	value		uniform 0;
    }

    entrainmentBottom
    {
        type            calculated;
 	value		uniform 0;
    }

    entrainmentWestSide
    {
        type            calculated;
 	value		uniform 0;
    }
      entrainmentNorthSide
    {
        type            calculated;
 	value		uniform 0;
    }

   entrainmentEastSide
    {
        type            calculated;
 	value		uniform 0;
    }

   entrainmentSouthSide
    {
        type            calculated;
 	value		uniform 0;
    }
   fixedWalls
    {
        type            calculated;
 	value		uniform 0;
    }

//    frontAndBack
//    {
//        type            empty;
//    }
}


// ************************************************************************* //
