slotburner-fpv-halfmillioncell/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-4;//fan suan u'/u =?<5%?:

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    entrainmentBottom
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    entrainmentWestSide
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    entrainmentNorthSide
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    entrainmentEastSide
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    entrainmentSouthSide
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    fixedWalls
    {
        type            zeroGradient;
    }

    inletFuel
    {
        type            fixedValue;
        value           $internalField;
    }

    inletCoflow
    {
        type            fixedValue;
        value           $internalField;
    }

}


// ************************************************************************* //
