slotburner-fpv-halfmillioncell/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000; 

boundaryField
{

  "(entrainmentBottom|entrainmentWestSide|entrainmentNorthSide|entrainmentEastSide|entrainmentSouthSide|fixedWalls|inletFuel|inletCoflow)"
    {
        type            calculated;
	value		$internalField;
    }

     

    outlet
    {
	type		calculated;
	value		$internalField; 
    }
}


// ************************************************************************* //
