slotburner-fpv-halfmillioncell/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cellPoint;

setFormat       csv;

sets
(
    data_T-Z
    {
        type    uniform;
        axis    z;
        start   (0 0 0);
        end     (0 0 2);
        nPoints 100;
    }
    data_T-X(Z=0.25)
    {
        type    uniform;
        axis    x;
        start   (-0.3 0 0.25);
        end     (0.3 0 0.25);
        nPoints 100;
    }

    data_T-X(Z=0.5)
    {
        type    uniform;
        axis    x;
        start   (-0.3 0 0.25);
        end     (0.3 0 0.25);
        nPoints 100;
    }

);

fields          (T);

// ************************************************************************* //
